app/controllers/home_controller.rb

  def index
    if user_signed_in?
      user = User.find(current_user.id)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1